[
  {
    "title": "Michael Bloomberg Donates 100 Million Shekels To Rebuild Northern Israel",
    "author": "Shmuel123",
    "published_at": "2024-12-05T13:19:26+00:00",
    "description": "Billionaire Michael Bloomberg, with an estimated fortune of $102 billion according to Forbes, has announced a donation of 100 million shekels (approximately $27.8 million) to help rebuild areas in northern Israel, Ynet reports.",
    "mood": 2
  },
  {
    "title": "“Entire neighbourhoods” in Gaza being levelled by Israeli contractors",
    "author": null,
    "published_at": "2024-12-05T13:10:39+00:00",
    "description": "Jehad Abusalim on how Israel is decimating the Gaza Strip, and what that means for the people living there.",
    "mood": 8
  },
  {
    "title": "Michael Bloomberg donates $27.8 million to reconstruction in northern Israel",
    "author": null,
    "published_at": "2024-12-05T13:03:47+00:00",
    "description": "The richest Jew in the world, through the Bloomberg Sagol Center, will oversee the program; Moshe Davidovich, head of the Meta Asher Regional Council: \"Thanks to Bloomberg and other amazing donors who have opened their hearts and pockets, I am convinced that we will not only rehabilitate the North, but lead it to a prosperity that it has never seen'",
    "mood": 2
  },
  {
    "title": "NYU Law admin threatens pro-Palestinian students with disciplinary action, LSJP claims",
    "author": "Aashna Miharia and Yezen Saadah",
    "published_at": "2024-12-05T13:01:43+00:00",
    "description": "An administrator at the School of Law threatened a group of students with disciplinary action for hosting a pro-Palestinian study-in at the law school library, the NYU Law Students for Justice in Palestine claimed in a Wednesday Instagram post.  At the silent demonstration, which LSJP said took place Monday, law students displayed signs on the...This story NYU Law admin threatens pro-Palestinian students with disciplinary action, LSJP claims appeared first on Washington Square News.",
    "mood": 7
  },
  {
    "title": "Owns a ‘Quarter of New York’, Floyd Mayweather Leaves Fans Jaw-Dropped by Showing Off His Lavish Suite During His Stay in Israel",
    "author": "Sudeep Sinha",
    "published_at": "2024-12-05T12:58:47+00:00",
    "description": "According to reports from the Israeli media, former five-division champion Floyd Mayweather visited an embattled Israel a while back after an invite from Jewish businessman Yona Rechnitz. Now, weeks later, he seems to have flown back to the country in his private jet, as he flaunted the hotel room, named after him, ‘Mayweather Suite’ where he [&#8230;]The post Owns a ‘Quarter of New York’, Floyd Mayweather Leaves Fans Jaw-Dropped by Showing Off His Lavish Suite During His Stay in Israel appeared first on EssentiallySports.",
    "mood": 3
  },
  {
    "title": "Israel returns bodies of militants who crossed border from Jordan",
    "author": "Naharnet Newsdesk",
    "published_at": "2024-12-05T12:51:40+00:00",
    "description": "Israel returns bodies of militants who crossed border from Jordan",
    "mood": 4
  },
  {
    "title": "Report: Hezbollah Has Already Started Rebuilding Its Forces & Arms Caches",
    "author": "Sarare",
    "published_at": "2024-12-05T12:43:16+00:00",
    "description": "US intelligence officials say that the Hezbollah terror group in Lebanon, which was significantly compromised militarily by Israel in the recent war, is already engaged in rehabilitating its forces and replenishing its weapons caches, Reuters reported. The officials said that Hezbollah still poses a long-term threat to the US and its regional allies. Four sources updated on US intelligence told Reuters that even while the war between Israel and Lebanon was still ongoing, Hezbollah began to recruit new members and was assessing ways to rearm through domestic production and by smuggling materials...",
    "mood": 6
  },
  {
    "title": "Israel targets Civil Defense crews in Naqoura",
    "author": "Naharnet Newsdesk",
    "published_at": "2024-12-05T12:38:34+00:00",
    "description": "Israel targets Civil Defense crews in Naqoura",
    "mood": 8
  },
  {
    "title": "WATCH REALITY HIT: Anti-Israel Students Squirm When They’re Shown Hamas Horrors Unfold [VIDEO]",
    "author": "Shmuel123",
    "published_at": "2024-12-05T12:30:54+00:00",
    "description": "In a provocative social experiment, two Israeli influencers, dressed to mimic a Hamas supporter and a Hamas terrorist, staged a performance that spotlighted campus tensions surrounding the Israel-Hamas conflict. The influencers pretended to celebrate the graphic footage from the October 7th Hamas attacks, testing the reactions of anti-Israel students who have been vocal in their criticism of Israel. The influencers’ performance involved simulated joy at the harrowing scenes of the attack. However, their act quickly elicited squeamishness among the students. Despite their outspoken political...",
    "mood": 7
  },
  {
    "title": "Amnesty International: Israel committing genocide against Palestinians in occupied Gaza",
    "author": null,
    "published_at": "2024-12-05T12:21:45+00:00",
    "description": "An Amnesty International report finds Israel is committing genocide in Gaza, accusing it of brazenly unleashing \"hell and destruction\" on Palestinians with \"total impunity.\"",
    "mood": 9
  }
]